<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox2","backend":"3b07838a8e781301ecb984c27e27ca455e7ccc9828ade1429be5829a8dfc34e1","plan_job_ref":"Job .github/workflows/_test-tf-deploy.yaml #4 at https://github.com/tx-pts-dai/github-workflows/actions/runs/8521544040","plan_out_hash":"fa70397298a7d4d66a27865643b0c0b9cb609e1b5200628dfb9604de1aa0b5b4","plan_hash":"44ab6907b255eb22bfbaa53a15e4a6f867422f278d81eb091b6bc4d0bea730d3","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __sandbox2__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf-deploy.yaml #4](https://github.com/tx-pts-dai/github-workflows/actions/runs/8521544040)